# St7SetInfluenceMultiVariableType

Sets the type of a multi-variable load influence combination case.

long St7SetInfluenceMultiVariableType(long uID, long MultiVariableCaseID,
long MultiVariableType)
Input Parameters
uID
Strand7 model file ID.
MultiVariableCaseID
ID of the load influence multi-variable combination case.
MultiVariableType
Either icInfluenceMin or icInfluenceMax.